[tasks]
prep
stage_1 cover
stage_2 cover
stage_3_init
stage_3a_cover cover
stage_3b_assert

[options]
prep:
mode prep

cover:
mode cover
skip_prep on

stage_3_init:
mode prep
skip_prep on

stage_3b_assert:
mode prove
skip_prep on

--

[engines]

prep:
none

cover:
smtbmc

stage_3_init:
none

stage_3b_assert:
smtbmc

--

[script]

# This separate prep step generates model_prep.il, which is our ground-truth
# design file from which all other checkpoints are derived. It is essential
# to have at least one prep step in `mode prep`, as we must produce a .il file
# which has had the SBY-internal prep routine run on it. Any file written
# in the user-provided script below will represent the state of the design 
# *before* the SBY prep routine. (Note that the `prep` pass below is *not*
# the SBY prep routine, but just the Yosys synthesis pass.)
prep:
verific -formal Req_Ack.sv
hierarchy -top DUT
prep

stage_1:
read_rtlil design_prep.il

# Write checkpoint file.
write_rtlil stage_1_init.il

# This selection computes (all phase-labeled things) - (all phase-1-labeled
# things) to remove all phase-tagged SVA constructs not intended for phase 1.
select */c:phase* */c:phase1* %d
delete

stage_2:
# Read the stage 1 checkpoint, and then use the stage 1 trace to simulate up
# to the end of stage 1.
# Note that, in stage 2, we do not use -noinitstate on sim, as this first 
# simulation begins at t=0 and thus $initstate cells should be active. All 
# future calls to sim should include -noinitstate.
read_rtlil stage_1_init.il
sim -a -w -scope DUT -r trace0.yw
write_rtlil stage_2_init.il

select */c:phase* */c:phase2* %d
delete

stage_3_init:
read_rtlil stage_2_init.il

# Use -noinitstate, as this simulation does not begin at t=0.
sim -a -w -scope DUT -r trace0.yw -noinitstate

write_rtlil stage_3_init.il

stage_3a_cover:
read_rtlil stage_3_init.il
select */c:phase* */c:phase3_shared* */c:phase3a* %u %d
delete

stage_3b_assert:
read_rtlil stage_3_init.il
select */c:phase* */c:phase3_shared* */c:phase3b* %u %d
delete


--

[files]

prep:
Req_Ack.sv

stage_1:
skip_staged_flow_prep/model/design_prep.il

stage_2:
skip_staged_flow_stage_1/src/stage_1_init.il
skip_staged_flow_stage_1/engine_0/trace0.yw

stage_3_init:
skip_staged_flow_stage_2/src/stage_2_init.il
skip_staged_flow_stage_2/engine_0/trace0.yw

stage_3a_cover:
skip_staged_flow_stage_3_init/src/stage_3_init.il

stage_3b_assert:
skip_staged_flow_stage_3_init/src/stage_3_init.il
