[tasks]
prep
stage_1 cover
stage_2 cover
stage_3_init
stage_3a_cover cover
stage_3b_assert

[options]
prep:
mode prep

cover:
mode cover
skip_prep on

stage_3_init:
mode prep
skip_prep on

stage_3b_assert:
mode prove
skip_prep on

--

[engines]

prep:
none

cover:
smtbmc

stage_3_init:
none

stage_3b_assert:
smtbmc

--

[script]

prep:
verific -formal Req_Ack.sv
hierarchy -top DUT
prep

stage_1:
read_rtlil design_prep.il

write_rtlil stage_1_init.il

select */c:stage* */c:stage1* %d
delete

stage_2:
read_rtlil stage_1_init.il
sim -a -w -scope DUT -r trace0.yw
write_rtlil stage_2_init.il

select */c:stage* */c:stage2* %d
delete

stage_3_init:
read_rtlil stage_2_init.il

sim -a -w -scope DUT -r trace0.yw -noinitstate

write_rtlil stage_3_init.il

stage_3a_cover:
read_rtlil stage_3_init.il
select */c:stage* */c:stage3_shared* */c:stage3a* %u %d
delete

stage_3b_assert:
read_rtlil stage_3_init.il
select */c:stage* */c:stage3_shared* */c:stage3b* %u %d
delete


--

[files]

prep:
Req_Ack.sv

stage_1:
skip_staged_flow_prep/model/design_prep.il

stage_2:
skip_staged_flow_stage_1/src/stage_1_init.il
skip_staged_flow_stage_1/engine_0/trace0.yw

stage_3_init:
skip_staged_flow_stage_2/src/stage_2_init.il
skip_staged_flow_stage_2/engine_0/trace0.yw

stage_3a_cover:
skip_staged_flow_stage_3_init/src/stage_3_init.il

stage_3b_assert:
skip_staged_flow_stage_3_init/src/stage_3_init.il
