[tasks]
stage_1
stage_2
stage_3_init
stage_3a_cover
stage_3b_assert

[options]
stage_1:
mode cover

stage_2:
mode cover
skip_prep on

stage_3_init:
mode prep
skip_prep on

stage_3a_cover:
mode cover
skip_prep on

stage_3b_assert:
mode prove
skip_prep on

--

[engines]
smtbmc

stage_3_init:
none

--

[script]
stage_1:
verific -formal Req_Ack.sv
hierarchy -top DUT
prep

# Write checkpoint file.
write_rtlil stage_1_init.il

# This selection computes (all phase-labeled things) - (all phase-1-labeled
# things) to remove all phase-tagged SVA constructs not intended for phase 1.
select */c:phase* */c:phase1* %d
delete

stage_2:
read_rtlil stage_1_init.il
# Note that, in stage 2, we do not use -noinitstate, as this first simulation
# begins at t=0. All future calls to sim should include -noinitstate.
sim -a -w -scope DUT -r trace0.yw

write_rtlil stage_2_init.il
select */c:phase* */c:phase2* %d
delete

stage_3_init:
read_rtlil stage_2_init.il

# Use -noinitstate, as this simulation does not begin at t=0.
sim -a -w -scope DUT -r trace0.yw -noinitstate

write_rtlil stage_3_init.il

stage_3a_cover:
read_rtlil stage_3_init.il
select */c:phase* */c:phase3_shared* */c:phase3a* %u %d
delete

stage_3b_assert:
read_rtlil stage_3_init.il
select */c:phase* */c:phase3_shared_* */c:phase3b* %u %d
delete


--

[files]

stage_1:
Req_Ack.sv

stage_2:
skip_staged_flow_stage_1/src/stage_1_init.il
skip_staged_flow_stage_1/engine_0/trace0.yw

stage_3_init:
skip_staged_flow_stage_2/src/stage_2_init.il
skip_staged_flow_stage_2/engine_0/trace0.yw

stage_3a_cover:
skip_staged_flow_stage_3_init/src/stage_3_init.il

stage_3b_assert:
skip_staged_flow_stage_3_init/src/stage_3_init.il
